app/controllers/fillups_controller.rb

SELECT "fillups".* FROM "fillups"  WHERE "fillups"."user_id" = 11
---
  def index
    record = Fillup.where(user_id: @user.id)