app/controllers/maintenance_records_controller.rb

INSERT INTO "maintenance_records" ("comment", "completed_at", "created_at", "gallons", "grade", "mileage", "price_per_gallon", "type", "updated_at", "user_id", "vehicle_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    if not find_vehicle
      render :json => { error: 'Invalid vehicle' }, :status => :bad_request
    else
      record = type_class.new(maintenance_record_params)
      record.user_id = @user.id

      if not params[:completed_at]
        record.completed_at = Time.now
      end

      record.save

UPDATE "maintenance_records" SET "comment" = $1, "completed_at" = $2, "mileage" = $3, "price_per_gallon" = $4, "updated_at" = $5 WHERE "maintenance_records"."type" IN ('Fillup') AND "maintenance_records"."id" = 8  [["comment", "Ewwy, eech."], ["completed_at", nil], ["mileage", 110999], ["price_per_gallon", 3.299], ["updated_at", "2014-05-23 03:35:47.705679"]]
---
  def update
    record = find_record
    if not record
      render :json => { error: 'Record not found' }, :status => :not_found
    else
      if not find_vehicle
        render :json => { error: 'Invalid vehicle' }, :status => :bad_request
      elsif not record.update(maintenance_record_params)

SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."user_id" = 1 AND "vehicles"."id" IS NULL LIMIT 1
---
  def find_vehicle
    Vehicle.find_by(user_id: @user.id, id: params[:vehicle_id])