app/controllers/users_controller.rb

  def index
    @users = User.all()
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"