app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
  def index
    @vehicles = Vehicle.all()