app/controllers/vehicles_controller.rb

  def index
    vehicles = Vehicle.where(user_id: @user.id)
---
SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."user_id" = 11 LIMIT 1

  def show
    vehicle = Vehicle.find_by(user_id: @user.id, id: params[:id])
---
SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."user_id" = 11 AND "vehicles"."id" = 1 LIMIT 1

  def create
    vehicle = Vehicle.new(vehicle_params)
    vehicle.user_id = @user.id
    vehicle.save
---
INSERT INTO "vehicles" ("created_at", "make", "model", "name", "updated_at", "user_id", "year") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2014-05-17 04:22:26.178073"], ["make", "eNot"], ["model", "yta"], ["name", "Nick"], ["updated_at", "2014-05-17 04:22:26.178073"], ["user_id", 11], ["year", 2104]]

  def update
    vehicle = Vehicle.find_by(user_id: @user.id, id: params[:id])
    if vehicle.update(vehicle_params)
---
SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."user_id" = 11 AND "vehicles"."id" = 1 LIMIT 1
UPDATE "vehicles" SET "make" = $1, "model" = $2, "name" = $3, "updated_at" = $4, "year" = $5 WHERE "vehicles"."id" = 1  [["make", "Ford"], ["model", "Focus"], ["name", "Focus"], ["updated_at", "2014-05-17 02:38:34.905064"], ["year", 2004]]

  def destroy
    vehicle = Vehicle.find_by(user_id: @user.id, id: params[:id])
    if vehicle.destroy
---
SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."user_id" = 11 AND "vehicles"."id" = 2 LIMIT 1
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 2]]